{
  "title": "Lorenzo Gangemi",
  "home": "Home",
  "projects": "Progetti",
  "career": "Carriera",
  "timeline_title": "Timeline",
  "not_found": "Pagina non trovata",
  "tech": "Tecnologie",
  "tech_text": "La maggior parte della mia esperienza riguarda lo sviluppo mobile, ma sono sempre stato appassionato di qualsiasi cosa fosse innovativo.\nRecentemente trascorro la maggior parte del mio tempo programmando in Flutter e Golang, ma quando posso mi dedico a Solidity e sviluppo di smart contracts. 📱💻",
  "mobile_web_dev": "Sviluppatore Mobile e Web con sede in Italia!",
  "hey": "Ciao! Sono Lorenzo 👋",
  "description": "Ingegnere Software, RedBull.",
  "bio": "Bio",
  "bio_text": "Software engineer specializzato in app mobile e sistemi distribuiti.\nAttualmente ricopro la posizione di Mobile Software Engineer presso RedBull.",
  "go": "Vai",
  "brightness": "Luminosità",
  "resume": "Curriculum",
  "live": "Live",
  "source_code": "Source code",
  "pub_dev": "Pub.dev",
  "employment": "Esperience professionali",
  "education": "Educazione",
  "professional_projects": "Progetti Professionali",
  "os_projects": "Progetti Open Source",
  "chip": {
    "flutter": "Flutter",
    "go": "Go",
    "gRPC": "gRPC",
    "graphQL": "GraphQL",
    "firebase": "Firebase",
    "android_java": "Android Java",
    "scrum": "Scrum",
    "distributed_systems": "Distributed Systems",
    "networks": "Networks",
    "security": "Security",
    "kotlin": "Kotlin",
    "rust": "Rust",
    "react": "React",
    "nodejs": "Node.js",
    "algorithms": "Algorithms",
    "oop": "Object oriented programming",
    "cplspls": "C++",
    "java": "java",
    "python": "Python",
    "solidity": "Solidity",
    "ganache": "Ganache",
    "truffle": "Truffle",
    "shaders": "Shaders",
    "rest": "REST",
    "performance": "Performance"
  },
  "timeline": {
    "year_redbull_to": "Attuale",
    "year_redbull_from": "Mag.2024",
    "title_redbull": "RedBull",
    "subtitle_redbull": "Salisburgo, Austria",
    "content_redbull": "• Giving wings to digital signage.",
    "year_young_to": "Mag.2024",
    "year_young_from": "Apr.2023",
    "title_young": "Young Platform",
    "subtitle_young": "Torino, Italia",
    "content_young": "• Ho contribuito alla costruzione del principale Exchange di Cryptovalute Italiano.\n• Sono stato introdotto al lavoro su un progetto rilasciato in produzione. Questo ha richiesto di adattarsi e interagire con flussi già stabiliti, migliorando al contempo gli standard.\n• Ho lavorato su funzionalità di entry point come il processo di autenticazione e l'onboarding.\n • Con il team ci siamo occupati di funzionalità legate ai pagamenti, registrazioni di mandati e pagamento con SDD.",
    "year_master_to": "Attuale",
    "year_master_from": "Sep.2021",
    "title_master": "Laurea magistrale in Software engineering\nPolitecnico di Torino",
    "subtitle_master": "Turin, Italy",
    "year_patchai_to": "Gen.2023",
    "year_patchai_from": "Set.2021",
    "title_patchai": "AliraHealth",
    "subtitle_patchai": "Remoto",
    "content_patchai": "• Ho lavorato su un prodotto Healthcare in Scrum, dalla creazione al rilascio. \n• Ho sviluppato 2 applicazioni frontend, 1 mobile e 1 web, entrambe in Flutter, con pacchetti personalizzati condivisi, sistema di design e funzionalità di base. \n• Ho lavorato su 2 microservizi Go per raccogliere dati con gRPC ed esporli tramite API GraphQL. \n• Ho lavorato a stretto contatto con il team del prodotto, risolto bug di produzione regolari, apportato miglioramenti e discusso dei requisiti.",
    "year_starty_to": "Ott.2021",
    "year_starty_from": "Dic.2020",
    "title_starty": "Starty",
    "subtitle_starty": "Remoto",
    "content_starty": "• Ho lavorato con un piccolo team su un prodotto di startup, nel campo fintech. \n• Ho creato 1 applicazione mobile in Flutter e ho parzialmente gestito il backend Firebase. \n• Ho partecipato attivamente alle discussioni del team sulle decisioni tecniche della startup.",
    "year_polito_to": "Set.2021",
    "year_polito_from": "Set.2017",
    "title_polito": "Laurea triennale in Ingegneria Informatica\nPolitecnico di Torino",
    "subtitle_polito": "Torino, Italia",
    "year_mdptech_to": "Set.2017",
    "year_mdptech_from": "Lug.2016",
    "title_mdptech": "MDPtech",
    "subtitle_mdptech": "Manta, Italia",
    "content_mdptech": "• Prima esperienza come sviluppatore, in una piccola azienda locale.\n• Ho sviluppato diverse applicazioni Android per comunicare con macchine industriali utilizzando il Bluetooth Low Energy dello smartphone.\n• Ho interagito con componenti fisici/elettrici, magazzino e clienti.",
    "year_vallauri_to": "2016",
    "year_vallauri_from": "",
    "title_vallauri": "Diploma tecnico informatico\nI.I.S. G.Vallauri",
    "subtitle_vallauri": "Fossano, Italia",
    "from": "Da",
    "to": "a"
  },
  "project": {
    "young_platform_exchange_title": "Young Platform",
    "young_platform_exchange_content": "Exchange di criptovalute per l'acquisto e vendita di asset oltre che strumenti di investimento.\nLe principali sfide affrontate nel suo sviluppo includono il mantenimento di un ambiente di produzione costantemente aggiornato e privo di bug, la gestione di una vasta base di utenti, la garanzia di misure di sicurezza robuste e la gestione delle informazioni personali.",
    "myreco_title": "AliraHealth: MyReco",
    "myreco_content": "Questo progetto mira a fornire un'esperienza personalizzata per i pazienti che partecipano a studi clinici.\nÈ stato sviluppato durante la mia esperienza in AliraHealth.\nEra composto da un paio di Frontend in Flutter e un'architettura di microservizi sul backend.",
    "starty_title": "App StarTy",
    "starty_content": "Piattaforma di crowdfunding dedicata agli investimenti in startup e aziende tramite criptovalute e blockchain.\nMi sono occupato di costruire l'applicazione frontend utilizzando Flutter.\nAbbiamo utilizzato le funzioni di Firebase per interagire con i contratti blockchain.",
    "game_of_life_title": "Game of life",
    "game_of_life_content": "Questo progetto è un'implementazione del famoso gioco di Conway.",
    "flutter_starter_project_title": "PatchAii: Flutter Starter Project",
    "flutter_starter_project_content": "Template di avvio a cui io e i miei colleghi di AliraHealth abbiamo contribuito prima di iniziare il progetto aziendale.\nContiene la gestione dello stato, il modello di funzioni di generazione automatica, il routing, le traduzioni di base, le notifiche di base.",
    "todo_dapp_title": "Todo DAPP",
    "todo_dapp_content": "Questo progetto è un'applicazione mobile di base Todo costruita con Flutter.\nIl backend consiste in un contratto Solidity che gira sulla blockchain Ethereum.",
    "goak_title": "Goak",
    "goak_content": "Modulo Go per costruire un albero decisionale da un file Json ed eseguire una ricerca attraverso di esso.",
    "telegram_scraper_title": "Telegram Scraper",
    "telegram_scraper_content": "Script Python per estrarre gli utenti di telegram da un gruppo e spostarli in un altro.",
    "instagram_bot_title": "Instagram ADB Bot",
    "aura_box_title": "Aura box",
    "aura_box_content": "Flutter widget per combinare moteplici gradienti radiali e effetti di blur."
  }
}